AdityaDk10/UbicompLab-Pic24/main.c
/*
 * PIC24F Authentication System
 * 
 * A pattern-based authentication system using capacitive touch buttons
 * and OLED display for the PIC24F Starter Kit.
 * 
 * Features:
 *   - 2-digit user ID
 *   - 5-button swipe pattern password (Android-style)
 *   - Real-time pattern visualization
 *   - Multi-user support (up to 25 users)
 *   - Flash-based persistent storage (survives power cycle)
 * 
 * Hardware: PIC24F Starter Kit 1
 * 
 * Original hardware drivers by: kvl@eti.uni-siegen.de
 * Authentication system by: AdityaDk10
 * Repository: https://github.com/AdityaDk10/UbicompLab-Pic24
 */

#include "PIC24FStarter.h"
#include <stdio.h>

// ==================== FUNCTION PROTOTYPES ====================

// UI Functions
void DisplayCentered(const char* text);
void ShowMessage(const char* text, uint8_t seconds);
void DisplayTwoLines(const char* line1, const char* line2);
void DrawMainMenu(uint8_t screenIndex, uint8_t selectedIndex);
void DrawListSubMenu(uint8_t screenIndex, uint8_t selectedIndex);
void DisplayUserList(uint8_t filterType);
void DisplayLockedUsersWithNavigation(void);

// Input Functions
uint8_t WaitForButton(void);
int16_t CollectDigits(uint8_t numDigits, const char* prompt);
void CollectPattern(uint8_t* pattern, uint16_t* timing);

// Database Functions
void InitDatabase(void);
int8_t FindUser(int16_t userId);
uint8_t RegisterUser(int16_t userId, uint8_t* pattern, uint16_t* timing);
uint8_t ValidateLogin(int16_t userId, uint8_t* pattern, uint16_t* timing, uint8_t* timingWarningOut, uint8_t* segmentMatches);
uint8_t DeleteUser(int16_t userId);
uint8_t UnlockUser(int16_t userId);

// Flash Persistence Functions
void FlashReadDatabase(void);
void FlashWriteDatabase(void);

// Admin Functions
uint8_t VerifyAdminPassword(void);

// Pattern Display Functions
void DrawPatternGrid(void);
void DrawPatternLines(uint8_t* pattern, uint8_t length);
void UpdatePatternDisplay(uint8_t* pattern, uint8_t length);

// Visual Feedback Functions
void DrawCheckmark(int16_t x, int16_t y);
void DrawX(int16_t x, int16_t y);
void ShowLoadingAnimation(const char* baseText, uint16_t durationMs);
void ShowSuccess(const char* message);
void ShowError(const char* message);
void ShowTimingAnalysis(uint8_t* segmentMatches, uint8_t totalSegments);

// Utility Functions
void delay(unsigned int milliseconds);
void BlinkRGB(uint8_t r, uint8_t g, uint8_t b, uint8_t times, uint16_t onMs, uint16_t offMs);

// ==================== USER DATABASE ====================

#define PATTERN_LENGTH 5  // Fixed 5-button pattern
#define ADMIN_PASSWORD 1111  // Admin password for LIST menu access
#define MAX_USERS 25
#define FLASH_PAGE_ADDR  0x10000UL
#define FLASH_VALID_FLAG 0xA5A5

// User structure to hold credentials
typedef struct {
    int16_t userId;              // 2-digit ID
    uint8_t pattern[PATTERN_LENGTH];  // 5-button pattern (1-5)
    uint8_t isActive;            // 1 = slot used, 0 = empty
    uint8_t failedAttempts;      // Failed login attempts counter
    uint8_t isLoggedIn;         // 1 = currently logged in, 0 = not logged in
    uint16_t timing[PATTERN_LENGTH - 1]; // Inter-button timing in milliseconds (4 values for 5-button pattern)
} User;

User userDatabase[MAX_USERS];
uint8_t userCount = 0;

#define DELETED_HISTORY_MAX 10
int16_t deletedHistory[DELETED_HISTORY_MAX];
uint8_t deletedCount = 0;

// Button positions on screen (for pattern display)
// Button order: 0=UP, 1=RIGHT, 2=DOWN, 3=LEFT, 4=CENTER
const uint8_t buttonX[5] = {64, 100, 64, 28, 64};   // X coordinates
const uint8_t buttonY[5] = {12, 32, 52, 32, 32};    // Y coordinates

// Initialize database (mark all slots as empty)
void InitDatabase() {
    for (uint8_t i = 0; i < MAX_USERS; i++) {
        userDatabase[i].userId = 0;
        userDatabase[i].isActive = 0;
        userDatabase[i].failedAttempts = 0;
        userDatabase[i].isLoggedIn = 0;
        for (uint8_t j = 0; j < PATTERN_LENGTH; j++) {
            userDatabase[i].pattern[j] = 0;
        }
        for (uint8_t j = 0; j < PATTERN_LENGTH - 1; j++) {
            userDatabase[i].timing[j] = 0;
        }
    }
    userCount = 0;
    for (uint8_t i = 0; i < DELETED_HISTORY_MAX; i++) {
        deletedHistory[i] = 0;
    }
    deletedCount = 0;
}

// Find user by ID, returns index (0-9) or -1 if not found
int8_t FindUser(int16_t userId) {
    for (uint8_t i = 0; i < MAX_USERS; i++) {
        if (userDatabase[i].isActive && userDatabase[i].userId == userId) {
            return i;  // Found at index i
        }
    }
    return -1;  // Not found
}

// Compare two patterns, returns 1 if match, 0 if different
uint8_t ComparePatterns(uint8_t* pattern1, uint8_t* pattern2) {
    for (uint8_t i = 0; i < PATTERN_LENGTH; i++) {
        if (pattern1[i] != pattern2[i]) {
            return 0;  // Mismatch
        }
    }
    return 1;  // Match
}

// Register new user, returns 1 on success, 0 on failure
uint8_t RegisterUser(int16_t userId, uint8_t* pattern, uint16_t* timing) {
    // Check if database is full
    if (userCount >= MAX_USERS) {
        return 0;  // Database full
    }
    
    // Check if user ID already exists
    if (FindUser(userId) != -1) {
        return 0;  // ID already exists
    }
    
    // Find first empty slot and add user
    for (uint8_t i = 0; i < MAX_USERS; i++) {
        if (!userDatabase[i].isActive) {
            userDatabase[i].userId = userId;
            for (uint8_t j = 0; j < PATTERN_LENGTH; j++) {
                userDatabase[i].pattern[j] = pattern[j];
            }
            for (uint8_t j = 0; j < PATTERN_LENGTH - 1; j++) {
                userDatabase[i].timing[j] = timing[j];
            }
            userDatabase[i].isActive = 1;
            userDatabase[i].failedAttempts = 0;
            userDatabase[i].isLoggedIn = 0;
            userCount++;
            return 1;  // Success
        }
    }
    
    return 0;  // Should never reach here
}

// Validate login using pattern and timing with per-segment analysis.
// Returns 1 on success, 0 on failure.
// timingWarningOut: set to 1 if pattern matches but timing doesn't (warning case)
// segmentMatches: array of 4 values (1=match, 0=mismatch) for each timing segment
uint8_t ValidateLogin(int16_t userId, uint8_t* pattern, uint16_t* timing, uint8_t* timingWarningOut, uint8_t* segmentMatches) {
    const uint8_t TIMING_TOLERANCE_PERCENT = 40; // 40% tolerance for timing match
    const uint8_t MIN_SEGMENTS_REQUIRED = 2;     // At least 2/4 segments must match
    
