AdityaDk10/UbicompLab-Pic24/main.c
    *timingWarningOut = 0;
    
    // Initialize segment matches array
    for (uint8_t i = 0; i < PATTERN_LENGTH - 1; i++) {
        segmentMatches[i] = 0;
    }
    
    int8_t index = FindUser(userId);
    if (index == -1) {
        return 0;  // User not found
    }
    
    // Check pattern
    if (!ComparePatterns(userDatabase[index].pattern, pattern)) {
        return 0;  // Wrong pattern
    }
    
    // Check timing with tolerance - analyze each segment individually
    uint8_t segmentsMatched = 0;
    
    for (uint8_t i = 0; i < PATTERN_LENGTH - 1; i++) {
        uint16_t stored = userDatabase[index].timing[i];
        uint16_t input = timing[i];
        
        if (stored == 0 || input == 0) {
            segmentMatches[i] = 0;
            continue;
        }
        
        // Calculate difference percentage
        uint16_t diff = (stored > input) ? (stored - input) : (input - stored);
        uint32_t diffPercent = (uint32_t)diff * 100 / stored;
        
        if (diffPercent <= TIMING_TOLERANCE_PERCENT) {
            segmentMatches[i] = 1;  // This segment matches
            segmentsMatched++;
        } else {
            segmentMatches[i] = 0;  // This segment doesn't match
        }
    }
    
    // Require at least MIN_SEGMENTS_REQUIRED segments to match for successful login
    if (segmentsMatched < MIN_SEGMENTS_REQUIRED) {
        return 0;  // Login failed - not enough segments matched
    }
    
    // If not all segments match, set warning flag (but still allow login)
    if (segmentsMatched < (PATTERN_LENGTH - 1)) {
        *timingWarningOut = 1;
    }
    
    return 1;  // Pattern matches and enough timing segments match
}

// Delete user from database, returns 1 on success, 0 on failure
uint8_t DeleteUser(int16_t userId) {
    int8_t index = FindUser(userId);
    if (index == -1) {
        return 0;  // User not found
    }
    
    // Record in deleted history (shift oldest out if full)
    if (deletedCount < DELETED_HISTORY_MAX) {
        deletedHistory[deletedCount] = userId;
        deletedCount++;
    } else {
        for (uint8_t k = 0; k < DELETED_HISTORY_MAX - 1; k++) {
            deletedHistory[k] = deletedHistory[k + 1];
        }
        deletedHistory[DELETED_HISTORY_MAX - 1] = userId;
    }
    
    userDatabase[index].isActive = 0;
    userDatabase[index].userId = 0;
    userDatabase[index].failedAttempts = 0;
    userDatabase[index].isLoggedIn = 0;
    for (uint8_t j = 0; j < PATTERN_LENGTH; j++) {
        userDatabase[index].pattern[j] = 0;
    }
    for (uint8_t j = 0; j < PATTERN_LENGTH - 1; j++) {
        userDatabase[index].timing[j] = 0;
    }
    
    userCount--;  // Decrement user count
    return 1;  // Success
}

// Unlock user by resetting failed attempts, returns 1 on success, 0 on failure
uint8_t UnlockUser(int16_t userId) {
    int8_t index = FindUser(userId);
    if (index == -1) {
        return 0;  // User not found
    }
    
    // Reset failed attempts to unlock the account
    userDatabase[index].failedAttempts = 0;
    return 1;  // Success
}

// ==================== FLASH PERSISTENCE ====================

// NVM unlock sequence using pure inline assembly from DS39897C Example 5-5.
// This bypasses __builtin_write_NVM() to guarantee correct timing.
static void NVMUnlock(void) {
    asm volatile(
        "disi    #5          \n\t"
        "mov     #0x55, w0   \n\t"
        "mov     w0, _NVMKEY \n\t"
        "mov     #0xAA, w0   \n\t"
        "mov     w0, _NVMKEY \n\t"
        "bset    _NVMCON, #15\n\t"
        "nop                 \n\t"
        "nop"
        : : : "w0"
    );
}

static void FlashErasePage(uint32_t address) {
    uint16_t offset;

    TBLPAG = (uint16_t)(address >> 16);
    offset = (uint16_t)(address & 0xFFFF);
    __builtin_tblwtl(offset, 0x0000);
    NVMCON = 0x4042;
    NVMUnlock();
    while(NVMCONbits.WR);
    NVMCONbits.WREN = 0;
}

static void FlashWriteWord(uint32_t address, uint16_t data) {
    uint16_t offset;

    NVMCON = 0x4003;
    TBLPAG = (uint16_t)(address >> 16);
    offset = (uint16_t)(address & 0xFFFF);
    __builtin_tblwtl(offset, data);
    __builtin_tblwth(offset, 0x00);
    NVMUnlock();
    while(NVMCONbits.WR);
    NVMCONbits.WREN = 0;
}

void FlashWriteDatabase(void) {
    uint16_t i;
    uint16_t dbWords;
    uint16_t *src;
    uint32_t addr;

    FlashErasePage(FLASH_PAGE_ADDR);

    addr = FLASH_PAGE_ADDR;

    FlashWriteWord(addr, FLASH_VALID_FLAG);
    addr += 2;

    FlashWriteWord(addr, (uint16_t)userCount);
    addr += 2;

    src = (uint16_t *)userDatabase;
    dbWords = (sizeof(userDatabase) + 1) / 2;
    for(i = 0; i < dbWords; i++) {
        FlashWriteWord(addr, src[i]);
        addr += 2;
    }

    FlashWriteWord(addr, (uint16_t)deletedCount);
    addr += 2;

    src = (uint16_t *)deletedHistory;
    for(i = 0; i < DELETED_HISTORY_MAX; i++) {
        FlashWriteWord(addr, src[i]);
        addr += 2;
    }
}

void FlashReadDatabase(void) {
    uint32_t address = FLASH_PAGE_ADDR;
    uint16_t valid_flag;
    uint16_t storedCount;
    uint16_t *dest;
    uint16_t dbWords;
    uint16_t i;

    TBLPAG = (uint16_t)(address >> 16);

    valid_flag = __builtin_tblrdl((uint16_t)(address & 0xFFFF));
    address += 2;

    if(valid_flag != FLASH_VALID_FLAG) {
        InitDatabase();
        return;
    }

    storedCount = __builtin_tblrdl((uint16_t)(address & 0xFFFF));
    address += 2;
    userCount = (uint8_t)storedCount;

    dest = (uint16_t *)userDatabase;
    dbWords = (sizeof(userDatabase) + 1) / 2;
    for(i = 0; i < dbWords; i++) {
        dest[i] = __builtin_tblrdl((uint16_t)(address & 0xFFFF));
        address += 2;
    }

    for(i = 0; i < MAX_USERS; i++) {
        userDatabase[i].isLoggedIn = 0;
    }

    uint16_t storedDeleted = __builtin_tblrdl((uint16_t)(address & 0xFFFF));
    address += 2;
    deletedCount = (uint8_t)storedDeleted;
    if (deletedCount > DELETED_HISTORY_MAX) deletedCount = DELETED_HISTORY_MAX;

    dest = (uint16_t *)deletedHistory;
    for(i = 0; i < DELETED_HISTORY_MAX; i++) {
        dest[i] = __builtin_tblrdl((uint16_t)(address & 0xFFFF));
        address += 2;
    }
}

