AdityaDk10/UbicompLab-Pic24/main.c
// ==================== ADMIN FUNCTIONS ====================

// Verify admin password, returns 1 if correct, 0 if incorrect
uint8_t VerifyAdminPassword(void) {
    DisplayTwoLines("ENTER ADMIN", "PASSWORD");
    delay(2000);
    
    // Collect 4-digit password
    int16_t enteredPassword = CollectDigits(4, "PASS");
    
    // Verify password
    if (enteredPassword == ADMIN_PASSWORD) {
        return 1;  // Password correct
    } else {
        return 0;  // Password incorrect
    }
}

// ==================== PATTERN DISPLAY ====================

// Draw the 5 button positions as dots on screen
void DrawPatternGrid() {
    SetColor(WHITE);
    for (uint8_t i = 0; i < 5; i++) {
        DrawFilledCircle(buttonX[i], buttonY[i], 3);
    }
}

// Draw pattern lines connecting buttons
void DrawPatternLines(uint8_t* pattern, uint8_t length) {
    SetColor(WHITE);
    for (uint8_t i = 1; i < length; i++) {
        uint8_t prev = pattern[i-1] - 1;  // Convert 1-5 to 0-4 index
        uint8_t curr = pattern[i] - 1;
        DrawLine(buttonX[prev], buttonY[prev], buttonX[curr], buttonY[curr]);
    }
}

// Draw current pattern state (grid + lines so far)
void UpdatePatternDisplay(uint8_t* pattern, uint8_t length) {
    SetColor(BLACK);
    ClearDevice();
    DrawPatternGrid();
    if (length > 0) {
        DrawPatternLines(pattern, length);
        // Highlight last touched button
        uint8_t last = pattern[length-1] - 1;
        DrawFilledCircle(buttonX[last], buttonY[last], 5);
    }
    // Show pattern progress counter (e.g., "3/5")
    char progress[6];
    sprintf(progress, "%d/5", length);
    DrawString(100, 4, progress);
}

// ==================== VISUAL FEEDBACK ====================

// Draw a checkmark symbol (✓) using lines
void DrawCheckmark(int16_t x, int16_t y) {
    SetColor(WHITE);
    // Draw checkmark: two lines forming a check
    DrawLine(x, y + 2, x + 2, y + 4);
    DrawLine(x + 2, y + 4, x + 5, y + 1);
}

// Draw an X symbol (✗) using lines
void DrawX(int16_t x, int16_t y) {
    SetColor(WHITE);
    // Draw X: two diagonal lines
    DrawLine(x, y, x + 5, y + 5);
    DrawLine(x + 5, y, x, y + 5);
}

// Show loading animation with animated dots
// Returns after specified duration or when interrupted
void ShowLoadingAnimation(const char* baseText, uint16_t durationMs) {
    uint16_t elapsed = 0;
    uint8_t dotCount = 0;
    const uint16_t dotInterval = 300;  // Change dots every 300ms
    
    while (elapsed < durationMs) {
        char loadingText[20];
        uint8_t pos = 0;
        
        // Copy base text
        const char* src = baseText;
        while (*src && pos < 19) {
            loadingText[pos++] = *src++;
        }
        
        // Add dots based on animation state
        uint8_t dots = (dotCount % 4);  // Cycle: 0, 1, 2, 3 dots
        for (uint8_t i = 0; i < dots && pos < 19; i++) {
            loadingText[pos++] = '.';
        }
        loadingText[pos] = '\0';
        
        DisplayCentered(loadingText);
        
        delay(dotInterval);
        elapsed += dotInterval;
        dotCount++;
    }
}

// Show success message with checkmark
void ShowSuccess(const char* message) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    // Draw checkmark at top center
    DrawCheckmark(54, 8);
    
    // Draw message below checkmark
    uint8_t width = GetStringWidth(message);
    int16_t xPos = (DISP_HOR_RESOLUTION - width) / 2;
    DrawString(xPos, 30, message);
}

// Show error message with X symbol
void ShowError(const char* message) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    // Draw X at top center
    DrawX(54, 8);
    
    // Draw message below X
    uint8_t width = GetStringWidth(message);
    int16_t xPos = (DISP_HOR_RESOLUTION - width) / 2;
    DrawString(xPos, 30, message);
}

// Show per-segment timing analysis
// segmentMatches: array indicating which segments match (1=match, 0=mismatch)
// totalSegments: total number of segments (should be 4 for 5-button pattern)
void ShowTimingAnalysis(uint8_t* segmentMatches, uint8_t totalSegments) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    // Count matched segments
    uint8_t matchedCount = 0;
    for (uint8_t i = 0; i < totalSegments; i++) {
        if (segmentMatches[i]) {
            matchedCount++;
        }
    }
    
    // Display header
    DrawString(20, 4, "TIMING ANALYSIS:");
    
    // Display segment-by-segment results
    // Show each segment with ✓ or ✗
    // Adjusted spacing to prevent collision with summary
    for (uint8_t i = 0; i < totalSegments && i < 4; i++) {
        int16_t yPos = 16 + i * 11;  // Reduced spacing from 12 to 11, start at 16
        char segmentText[15];
        sprintf(segmentText, "SEG %d:", i + 1);
        DrawString(8, yPos, segmentText);
        
        // Draw checkmark or X based on match
        if (segmentMatches[i]) {
            DrawCheckmark(50, yPos);
        } else {
            DrawX(50, yPos);
        }
    }
    
    // Display summary - moved down to avoid collision
    char summary[20];
    sprintf(summary, "%d/%d MATCH", matchedCount, totalSegments);
    uint8_t width = GetStringWidth(summary);
    int16_t xPos = (DISP_HOR_RESOLUTION - width) / 2;
    DrawString(xPos, 58, summary);  // Moved from 56 to 58 for better spacing
}

// ==================== TIMER DELAY ====================
void delay(unsigned int milliseconds) {
    T1CONbits.TCKPS = 0b11; // Prescale 1:256
    PR1 = 47; TMR1 = 0; // Reset timer counter
    T1CONbits.TON = 1; // Turn on Timer1
    unsigned int count = 0;
    while (count < milliseconds) {
        while (!IFS0bits.T1IF); // Wait for Timer1 interrupt flag
        IFS0bits.T1IF = 0; // Clear Timer1 interrupt flag
        count++;
    }
    T1CONbits.TON = 0; // Turn off Timer1
}

// ==================== UI HELPER FUNCTIONS ====================

// Display text centered horizontally on screen
void DisplayCentered(const char* text) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    uint8_t textWidth = GetStringWidth(text);
    int16_t xPos = (DISP_HOR_RESOLUTION - textWidth) / 2;
    int16_t yPos = 24; // Middle page
    
