AdityaDk10/UbicompLab-Pic24/main.c
    DrawString(xPos, yPos, text);
}

// Display message for specified duration (in seconds)
void ShowMessage(const char* text, uint8_t seconds) {
    DisplayCentered(text);
    delay(seconds * 1000);
}

// Blink RGB LED with given color a number of times
void BlinkRGB(uint8_t r, uint8_t g, uint8_t b, uint8_t times, uint16_t onMs, uint16_t offMs) {
    for (uint8_t i = 0; i < times; i++) {
        SetRGBs(r, g, b);       // LED on with requested color
        delay(onMs);
        SetRGBs(0, 0, 0);       // LED off
        delay(offMs);
    }
}

// Display two lines of text
void DisplayTwoLines(const char* line1, const char* line2) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    uint8_t width1 = GetStringWidth(line1);
    int16_t x1 = (DISP_HOR_RESOLUTION - width1) / 2;
    DrawString(x1, 16, line1);
    
    uint8_t width2 = GetStringWidth(line2);
    int16_t x2 = (DISP_HOR_RESOLUTION - width2) / 2;
    DrawString(x2, 40, line2);
}

// Draw main menu with two side-by-side options
// screenIndex: 0 = Screen 1 (REGISTER | LOGIN), 1 = Screen 2 (DELETE | LIST)
// selectedIndex: 0 = Left option, 1 = Right option
void DrawMainMenu(uint8_t screenIndex, uint8_t selectedIndex) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);

    const char* leftText;
    const char* rightText;
    
    if (screenIndex == 0) {
        // Screen 1: REGISTER | LOGIN
        leftText = "REGISTER";
        rightText = "LOGIN";
    } else {
        // Screen 2: DELETE | LIST
        leftText = "DELETE";
        rightText = "LIST";
    }

    // Calculate positions for side-by-side layout
    // Screen is 128 pixels wide, 64 pixels tall
    const int16_t yCenter = 32;        // Vertical center of screen
    const int16_t xLeftCenter = 32;     // Center of left half (128/4)
    const int16_t xRightCenter = 96;    // Center of right half (128*3/4)
    
    // Draw left option (centered in left half)
    uint8_t widthLeft = GetStringWidth(leftText);
    int16_t xLeft = xLeftCenter - widthLeft / 2;
    DrawString(xLeft, yCenter, leftText);
    
    // Draw right option (centered in right half)
    uint8_t widthRight = GetStringWidth(rightText);
    int16_t xRight = xRightCenter - widthRight / 2;
    DrawString(xRight, yCenter, rightText);
    
    // Draw vertical separator line in the middle
    DrawLine(64, 20, 64, 44);  // Vertical line at screen center

    // Draw highlight rectangle around the selected option
    const int8_t paddingX = 6;
    const int8_t paddingY = 6;
    int16_t rectX, rectY, rectW, rectH;
    
    if (selectedIndex == 0) {
        // Left option selected
        rectX = xLeft - paddingX;
        rectY = yCenter - paddingY;
        rectW = widthLeft + 2 * paddingX;
        rectH = 12 + 2 * paddingY;
    } else {
        // Right option selected
        rectX = xRight - paddingX;
        rectY = yCenter - paddingY;
        rectW = widthRight + 2 * paddingX;
        rectH = 12 + 2 * paddingY;
    }

    // Draw rectangle outline using four lines
    DrawLine(rectX, rectY, rectX + rectW, rectY);               // top
    DrawLine(rectX, rectY + rectH, rectX + rectW, rectY + rectH); // bottom
    DrawLine(rectX, rectY, rectX, rectY + rectH);               // left
    DrawLine(rectX + rectW, rectY, rectX + rectW, rectY + rectH); // right
}

// Draw LIST submenu with two screens and better spacing
// screenIndex: 0 = Screen 1 (REGISTERED, ACTIVE USERS, LOCKED), 1 = Screen 2 (DELETED, BACK)
// selectedIndex: 0-2 for Screen 1, 0-1 for Screen 2
// actualIndex: 0 = REGISTERED, 1 = ACTIVE USERS, 2 = LOCKED, 3 = DELETED, 4 = BACK
void DrawListSubMenu(uint8_t screenIndex, uint8_t selectedIndex) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);

    const char* regUsersText = "REGISTERED";
    const char* loggedInText = "ACTIVE USERS";
    const char* lockedText = "LOCKED";
    const char* deletedText = "DELETED";
    const char* backText = "BACK";

    // Variables for selected option position
    int16_t xPos, yPos;
    uint8_t textWidth;

    if (screenIndex == 0) {
        // Screen 1: REGISTERED, ACTIVE USERS, LOCKED
        // Y positions with good spacing (centered vertically)
        const int16_t yReg = 12;
        const int16_t yLogged = 28;
        const int16_t yLocked = 44;

        // Draw all three options
        uint8_t widthReg = GetStringWidth(regUsersText);
        int16_t xReg = (DISP_HOR_RESOLUTION - widthReg) / 2;
        DrawString(xReg, yReg, regUsersText);

        uint8_t widthLogged = GetStringWidth(loggedInText);
        int16_t xLogged = (DISP_HOR_RESOLUTION - widthLogged) / 2;
        DrawString(xLogged, yLogged, loggedInText);

        uint8_t widthLocked = GetStringWidth(lockedText);
        int16_t xLocked = (DISP_HOR_RESOLUTION - widthLocked) / 2;
        DrawString(xLocked, yLocked, lockedText);

        // Get selected option position
        if (selectedIndex == 0) {
            xPos = xReg;
            yPos = yReg;
            textWidth = widthReg;
        } else if (selectedIndex == 1) {
            xPos = xLogged;
            yPos = yLogged;
            textWidth = widthLogged;
        } else {  // selectedIndex == 2
            xPos = xLocked;
            yPos = yLocked;
            textWidth = widthLocked;
        }
    } else {
        // Screen 2: DELETED, BACK
        // Y positions with good spacing (centered vertically)
        const int16_t yDeleted = 20;
        const int16_t yBack = 40;

        // Draw both options
        uint8_t widthDeleted = GetStringWidth(deletedText);
        int16_t xDeleted = (DISP_HOR_RESOLUTION - widthDeleted) / 2;
        DrawString(xDeleted, yDeleted, deletedText);

        uint8_t widthBack = GetStringWidth(backText);
        int16_t xBack = (DISP_HOR_RESOLUTION - widthBack) / 2;
        DrawString(xBack, yBack, backText);

        // Get selected option position
        if (selectedIndex == 0) {
            xPos = xDeleted;
            yPos = yDeleted;
            textWidth = widthDeleted;
        } else {  // selectedIndex == 1 (BACK)
            xPos = xBack;
            yPos = yBack;
            textWidth = widthBack;
        }
    }

    // Draw underline and arrow indicator for selected option
    // Draw arrow on the left side (">" symbol)
    const int16_t arrowX = 8;
    DrawString(arrowX, yPos, ">");
    
    // Draw underline below the selected text
    const int16_t underlineY = yPos + 12;  // Below the text
    const int16_t underlineStartX = xPos;
    const int16_t underlineEndX = xPos + textWidth;
    DrawLine(underlineStartX, underlineY, underlineEndX, underlineY);
}

// Display list of users based on filter type
// filterType: 0 = all registered, 1 = logged in, 2 = locked, 3 = deleted
void DisplayUserList(uint8_t filterType) {
    SetColor(BLACK);
    ClearDevice();
    SetColor(WHITE);
    
    // Set header based on filter type
    const char* header = "";
    if (filterType == 0) {
        header = "REGISTERED:";
    } else if (filterType == 1) {
        header = "ACTIVE USERS:";
    } else if (filterType == 2) {
        header = "LOCKED:";
    } else {
        header = "DELETED:";
    }
    
    uint8_t headerWidth = GetStringWidth(header);
    int16_t xHeader = (DISP_HOR_RESOLUTION - headerWidth) / 2;
    DrawString(xHeader, 4, header);
    
    // Count and display users
    uint8_t displayCount = 0;
    uint8_t shownCount = 0;
    
    for (uint8_t i = 0; i < MAX_USERS && shownCount < 4; i++) {
        uint8_t shouldDisplay = 0;
        
        if (filterType == 0) {
            // Show all registered users
            shouldDisplay = userDatabase[i].isActive;
        } else if (filterType == 1) {
            // Show logged in users
            shouldDisplay = userDatabase[i].isActive && userDatabase[i].isLoggedIn;
        } else if (filterType == 2) {
            // Show locked users (3 failed attempts)
            shouldDisplay = userDatabase[i].isActive && userDatabase[i].failedAttempts >= 3;
        } else {
            // Deleted users - these are removed from database, so show message
            shouldDisplay = 0;
        }
        
        if (shouldDisplay) {
            char userLine[20];
            sprintf(userLine, "ID: %02d", userDatabase[i].userId);
            DrawString(8, 18 + displayCount * 12, userLine);
            displayCount++;
            shownCount++;
        }
    }
    
    // Handle special cases - show appropriate messages when no users found
    if (filterType == 3) {
        if (deletedCount == 0) {
            DrawString(8, 18, "NO DELETED");
            DrawString(8, 30, "HISTORY");
        } else {
            uint8_t show = (deletedCount > 4) ? 4 : deletedCount;
            for (uint8_t d = 0; d < show; d++) {
                char delLine[20];
                sprintf(delLine, "ID: %02d", deletedHistory[d]);
                DrawString(8, 18 + d * 12, delLine);
            }
        }
    } else if (shownCount == 0 && displayCount == 0) {
        // No users found for this filter - show specific message
        if (filterType == 0) {
            // REGISTERED users
            DrawString(8, 18, "NO USERS ARE");
            DrawString(8, 30, "CURRENTLY");
            DrawString(8, 42, "REGISTERED");
        } else if (filterType == 1) {
            // ACTIVE USERS
            DrawString(8, 18, "NO USERS ARE");
            DrawString(8, 30, "CURRENTLY");
            DrawString(8, 42, "ACTIVE");
        } else if (filterType == 2) {
            // LOCKED users
            DrawString(8, 18, "NO USERS ARE");
            DrawString(8, 30, "CURRENTLY");
            DrawString(8, 42, "LOCKED");
        }
    }
    
    // For LOCKED users, use interactive navigation
    if (filterType == 2 && shownCount > 0) {
        // Use interactive navigation for locked users
        DisplayLockedUsersWithNavigation();
    } else {
        // For other filter types, just wait for button to return
        delay(2000);
        WaitForButton();
    }
}

// Display locked users with navigation and unlock option
void DisplayLockedUsersWithNavigation(void) {
    // First, collect all locked user IDs into an array
    int16_t lockedUserIds[MAX_USERS];
    uint8_t lockedCount = 0;
    
    for (uint8_t i = 0; i < MAX_USERS; i++) {
        if (userDatabase[i].isActive && userDatabase[i].failedAttempts >= 3) {
            lockedUserIds[lockedCount] = userDatabase[i].userId;
            lockedCount++;
        }
    }
    
    if (lockedCount == 0) {
        // No locked users - should not reach here, but handle it
        DisplayTwoLines("NO USERS ARE", "CURRENTLY LOCKED");
        delay(2000);
        WaitForButton();
        return;
    }
    
    // Navigation variables
    uint8_t selectedIndex = 0;  // Currently selected user in the list
    uint8_t inNavigation = 1;
    
    while (inNavigation) {
        SetColor(BLACK);
        ClearDevice();
        SetColor(WHITE);
        
        // Draw header
        DrawString(40, 4, "LOCKED:");
        
