AdityaDk10/UbicompLab-Pic24/main.c
        // Display up to 3 users at a time (with scrolling if more than 3) to leave space for instruction
        uint8_t startIndex = 0;
        if (selectedIndex >= 3) {
            startIndex = selectedIndex - 2;  // Show selected and 2 above
        }
        if (startIndex + 3 > lockedCount) {
            startIndex = (lockedCount >= 3) ? (lockedCount - 3) : 0;
        }
        
        uint8_t displayCount = 0;
        // Limit to 3 users to leave space for instruction
        uint8_t maxDisplay = (lockedCount > 3) ? 3 : lockedCount;
        for (uint8_t i = startIndex; i < lockedCount && displayCount < maxDisplay; i++) {
            char userLine[20];
            sprintf(userLine, "ID: %02d", lockedUserIds[i]);
            
            int16_t yPos = 16 + displayCount * 12;
            DrawString(8, yPos, userLine);
            
            // Highlight selected user with arrow and underline
            if (i == selectedIndex) {
                // Draw arrow on left
                DrawString(0, yPos, ">");
                // Draw underline
                uint8_t textWidth = GetStringWidth(userLine);
                DrawLine(8, yPos + 12, 8 + textWidth, yPos + 12);
            }
            
            displayCount++;
        }
        
        // Show instruction at bottom - centered and more visible
        // Draw a separator line above instruction
        DrawLine(0, 50, DISP_HOR_RESOLUTION, 50);
        const char* instructionText = "CENTER=UNLOCK";
        uint8_t instWidth = GetStringWidth(instructionText);
        int16_t instX = (DISP_HOR_RESOLUTION - instWidth) / 2;
        DrawString(instX, 56, instructionText);
        
        // Wait for button input
        uint8_t btn = WaitForButton();
        
        if (btn == 0) {          // UP
            if (selectedIndex > 0) {
                selectedIndex--;
            } else {
                // Wrap to bottom
                selectedIndex = lockedCount - 1;
            }
        } else if (btn == 2) {   // DOWN
            if (selectedIndex < lockedCount - 1) {
                selectedIndex++;
            } else {
                // Wrap to top
                selectedIndex = 0;
            }
        } else if (btn == 4) {   // CENTER = unlock selected user
            // Confirm unlock
            int16_t userIdToUnlock = lockedUserIds[selectedIndex];
            
            // Show confirmation
            char confirmMsg[30];
            sprintf(confirmMsg, "UNLOCK ID %02d?", userIdToUnlock);
            DisplayTwoLines(confirmMsg, "CENTER=YES");
            delay(2000);
            
            // Wait for confirmation
            uint8_t confirmBtn = WaitForButton();
            if (confirmBtn == 4) {  // CENTER = confirm
                // Unlock the user
                if (UnlockUser(userIdToUnlock)) {
                    FlashWriteDatabase();
                    ShowLoadingAnimation("UNLOCKING", 1000);
                    BlinkRGB(0, 255, 0, 3, 200, 200);
                    ShowSuccess("USER UNLOCKED");
                    delay(2000);
                    
                    // Remove unlocked user from list
                    // Shift array to remove unlocked user
                    for (uint8_t i = selectedIndex; i < lockedCount - 1; i++) {
                        lockedUserIds[i] = lockedUserIds[i + 1];
                    }
                    lockedCount--;
                    
                    // Adjust selected index if needed
                    if (selectedIndex >= lockedCount && lockedCount > 0) {
                        selectedIndex = lockedCount - 1;
                    }
                    
                    // If no more locked users, exit
                    if (lockedCount == 0) {
                        inNavigation = 0;
                        DisplayTwoLines("ALL USERS", "UNLOCKED");
                        delay(2000);
                    }
                } else {
                    BlinkRGB(255, 0, 0, 3, 200, 200);
                    ShowError("UNLOCK FAILED");
                    delay(2000);
                }
            }
            // If not confirmed, continue navigation
        } else if (btn == 3) {   // LEFT = back to LIST menu
            inNavigation = 0;
        }
        // Other buttons (1=RIGHT) are ignored
    }
}

// ==================== PATTERN INPUT ====================

// Check if button is already in pattern (no repeats)
uint8_t IsInPattern(uint8_t* pattern, uint8_t length, uint8_t button) {
    for (uint8_t i = 0; i < length; i++) {
        if (pattern[i] == button) return 1;
    }
    return 0;
}

// Collect pattern using swipe detection (like ball movement)
// Also captures timing between button presses in milliseconds
void CollectPattern(uint8_t* pattern, uint16_t* timing) {
    uint8_t patternLen = 0;
    int16_t aggr[5] = {0, 0, 0, 0, 0};
    uint8_t lastButton = 0xFF;
    const int16_t THRESHOLD = 6;
    const uint16_t timeout = 10;

    uint32_t lastButtonTime = 0;
    uint32_t currentTime = 0;

    for (uint8_t i = 0; i < PATTERN_LENGTH - 1; i++) {
        timing[i] = 0;
    }

    // Show initial grid
    SetColor(BLACK);
    ClearDevice();
    DrawPatternGrid();
    
    // Collect pattern until 5 buttons
    while (patternLen < PATTERN_LENGTH) {
        ReadCTMU();
        
        // Update aggregate values (same as ball movement logic)
        for (uint8_t i = 0; i < 5; i++) {
            if (buttons[i]) aggr[i]++;
            else aggr[i]--;
            if (aggr[i] < 0) aggr[i] = 0;
            if (aggr[i] > 30) aggr[i] = 30;
        }
        
        // Find which button currently has highest aggregate
        int16_t maxVal = THRESHOLD;
        uint8_t currentButton = 0xFF;
        for (uint8_t i = 0; i < 5; i++) {
            if (aggr[i] > maxVal) {
                maxVal = aggr[i];
                currentButton = i;
            }
        }
        
        // If touching a valid button
        if (currentButton != 0xFF) {
            uint8_t buttonNum = currentButton + 1;  // Convert 0-4 to 1-5
            
            // Check if it's a NEW button (not the same as last, not already in pattern)
            if (currentButton != lastButton && !IsInPattern(pattern, patternLen, buttonNum)) {
                // Calculate timing since last button (if not first button)
                if (patternLen > 0) {
                    // Time difference in loop iterations, convert to milliseconds
                    uint32_t timeDiff = currentTime - lastButtonTime;
                    timing[patternLen - 1] = (uint16_t)(timeDiff * timeout);  // Convert to milliseconds
                }
                
                // Add to pattern
                pattern[patternLen] = buttonNum;
                patternLen++;
                lastButton = currentButton;
                lastButtonTime = currentTime;  // Record time when this button was added
                
