AdityaDk10/UbicompLab-Pic24/main.c
                // Update display with new line
                UpdatePatternDisplay(pattern, patternLen);
            }
        }
        
        delay(timeout);
        currentTime++;  // Increment time counter
    }
    
    // Pattern complete - show final result for a moment
    delay(500);
}

// ==================== INPUT COLLECTION ====================

// Collect multi-digit number from button presses
int16_t CollectDigits(uint8_t numDigits, const char* prompt) {
    char input[10] = {0};
    char display[30] = {0};
    uint8_t digitCount = 0;
    int16_t aggr[5] = {0, 0, 0, 0, 0};
    uint8_t digitRegistered = 0; // Flag to prevent multiple registration
    const int16_t THRESHOLD = 6;
    const int16_t RELEASE_THRESHOLD = 2; // More strict release detection
    const uint16_t timeout = 10;

    while (digitCount < numDigits) {
        ReadCTMU();

        // Update aggregate values
        for (uint8_t i = 0; i < 5; i++) {
            if (buttons[i]) aggr[i]++;
            else aggr[i]--;
            if (aggr[i] < 0) aggr[i] = 0;
            if (aggr[i] > 30) aggr[i] = 30;
}

        // Check if all buttons are truly released (all aggregates near zero)
        uint8_t allReleased = 1;
        for (uint8_t i = 0; i < 5; i++) {
            if (aggr[i] > RELEASE_THRESHOLD) {
                allReleased = 0;
                break;
            }
        }

        // Reset flag when fully released
        if (allReleased && digitRegistered) {
            digitRegistered = 0;
        }

        // Only process new digit if not already registered
        if (!digitRegistered) {
            // Find highest aggregate button
            int16_t maxVal = THRESHOLD;
            uint8_t maxButton = 0xFF;
            for (uint8_t i = 0; i < 5; i++) {
                if (aggr[i] > maxVal) {
                    maxVal = aggr[i];
                    maxButton = i;
                }
            }

            // Register digit if button detected
            if (maxButton != 0xFF) {
                uint8_t digit = maxButton + 1; // Map buttons 0-4 to digits 1-5
                input[digitCount] = '0' + digit;
                digitCount++;

                // Update display
                sprintf(display, "%s: %s", prompt, input);
                DisplayCentered(display);

                digitRegistered = 1; // Lock further input until full release
            }
        }

        delay(timeout);
    }

    // Wait half a second after completing input before proceeding
    delay(500);
    
    // Convert string to number
    int16_t result = 0;
    for (uint8_t i = 0; i < numDigits; i++) {
        result = result * 10 + (input[i] - '0');
    }
    
    return result;
}

// ==================== MENU NAVIGATION ====================

// Wait for button press and return button number (0-4)
uint8_t WaitForButton() {
    int16_t aggr[5] = {0, 0, 0, 0, 0};
    uint8_t lastDetected = 0xFF;
    const int16_t THRESHOLD = 6;
    const uint16_t timeout = 10;

    while(1) {
        ReadCTMU();

        for (uint8_t i = 0; i < 5; i++) {
            if (buttons[i]) aggr[i]++;
            else aggr[i]--;
            if (aggr[i] < 0) aggr[i] = 0;
            if (aggr[i] > 30) aggr[i] = 30;
        }

        int16_t maxVal = THRESHOLD;
        uint8_t maxButton = 0xFF;
        for (uint8_t i = 0; i < 5; i++) {
            if (aggr[i] > maxVal) {
                maxVal = aggr[i];
                maxButton = i;
            }
        }

        if (maxButton != 0xFF && maxButton != lastDetected) {
            delay(200); // Debounce
            return maxButton;
        } else if (maxButton == 0xFF) {
            lastDetected = 0xFF;
        }

        delay(timeout);
    }
}

// ==================== MAIN APPLICATION ====================

int main(void) {
    INIT_CLOCK(); 
    CTMUInit(); 
    RGBMapColorPins();
    
    RGBTurnOnLED();
    ResetDevice();
    
    // Load user database from Flash (first boot initializes empty database)
    FlashReadDatabase();
    
    // Startup greeting
    ShowMessage("HELLO!", 3);
    
    // Main application loop
    while(1) { 
        // Main menu with two screens, side-by-side options:
        // Screen 0: REGISTER (left) | LOGIN (right)
        // Screen 1: DELETE (left) | LIST (right)
        // Button mapping (index from WaitForButton):
        //   0 = UP (go to screen 0), 2 = DOWN (go to screen 1), 
        //   3 = LEFT (select left option), 1 = RIGHT (select right option), 4 = CENTER (confirm selection)
        uint8_t screenIndex = 0;      // 0 = Screen 1 (REGISTER|LOGIN), 1 = Screen 2 (DELETE|LIST)
        uint8_t selectedIndex = 0;    // 0 = Left option, 1 = Right option
        uint8_t inMenu = 1;

        while (inMenu) {
            DrawMainMenu(screenIndex, selectedIndex);
            uint8_t btn = WaitForButton();

            if (btn == 0) {          // UP (button 1) - go to screen 0
                screenIndex = 0;
                selectedIndex = 0;   // Reset to left option
                // Redraw immediately to show screen change
                DrawMainMenu(screenIndex, selectedIndex);
                delay(100);  // Small delay to ensure screen update is visible
            } else if (btn == 2) {   // DOWN (button 3) - go to screen 1
                screenIndex = 1;
                selectedIndex = 0;   // Reset to left option
                // Redraw immediately to show screen change
                DrawMainMenu(screenIndex, selectedIndex);
                delay(100);  // Small delay to ensure screen update is visible
            } else if (btn == 3) {   // LEFT (button 4) - select left option
                selectedIndex = 0;
            } else if (btn == 1) {   // RIGHT (button 2) - select right option
                selectedIndex = 1;
            } else if (btn == 4) {   // CENTER (button 5) = confirm selection
                inMenu = 0;
            }
        }

        // Determine which option was selected based on screen and position
        uint8_t finalSelection;
        if (screenIndex == 0) {
            // Screen 0: REGISTER (0) or LOGIN (1)
            finalSelection = selectedIndex;
        } else {
            // Screen 1: DELETE (2) or LIST (3)
            finalSelection = selectedIndex + 2;
        }

