AdityaDk10/UbicompLab-Pic24/main.c
        if (finalSelection == 0) {  // REGISTER selected
            // Registration flow
            ShowMessage("REGISTER MENU", 1);
            ShowMessage("LOADING...", 2);
            
            // Check if database is full
            if (userCount >= MAX_USERS) {
                // Failure: database full -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                DisplayTwoLines("DATABASE", "FULL!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Prompt for ID
            DisplayTwoLines("PLEASE ENTER", "ID");
            delay(2000);
            
            // Collect 2-digit ID (automatically proceeds)
            int16_t userId = CollectDigits(2, "ID");
            
            // Check if ID already exists
            if (FindUser(userId) != -1) {
                // Failure: ID already exists -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                DisplayTwoLines("ID ALREADY", "EXISTS!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Prompt for Pattern
            DisplayTwoLines("DRAW YOUR", "PATTERN");
            delay(2000);
            
            // Collect 5-button pattern (swipe-based)
            uint8_t pattern[PATTERN_LENGTH];
            uint16_t timing[PATTERN_LENGTH - 1];
            CollectPattern(pattern, timing);
            
            // Register the user
            if (RegisterUser(userId, pattern, timing)) {
                FlashWriteDatabase();
                // Success: registration -> GREEN blink
                BlinkRGB(0, 255, 0, 3, 200, 200);
                ShowSuccess("REGISTRATION SUCCESS");
                delay(2000);
            } else {
                // Failure: registration -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                ShowError("REGISTRATION FAILED");
                delay(2000);
            }
            ShowMessage("REDIRECTING...", 1);
            
        } else if (finalSelection == 1) {  // LOGIN selected
            // Login flow
            ShowMessage("LOGIN MENU", 1);
            ShowMessage("LOADING...", 2);
            
            // Prompt for ID
            DisplayTwoLines("PLEASE ENTER", "ID");
            delay(2000);
            
            // Collect 2-digit ID (automatically proceeds)
            int16_t userId = CollectDigits(2, "ID");
            
            // Check if user exists
            int8_t userIndex = FindUser(userId);
            if (userIndex == -1) {
                ShowLoadingAnimation("CHECKING", 1000);
                // Failure: invalid user ID -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                ShowError("INVALID USER ID");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Check if account is locked (3 failed attempts)
            if (userDatabase[userIndex].failedAttempts >= 3) {
                ShowLoadingAnimation("CHECKING", 1000);
                // Failure: account already locked -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                ShowError("ACCOUNT LOCKED");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu - don't allow login
            }
            
            // Prompt for Pattern
            DisplayTwoLines("DRAW YOUR", "PATTERN");
            delay(2000);
            
            // Collect 5-button pattern (swipe-based)
            uint8_t pattern[PATTERN_LENGTH];
            uint16_t timing[PATTERN_LENGTH - 1];
            CollectPattern(pattern, timing);
            
            // Validate credentials
            ShowLoadingAnimation("CHECKING", 2000);
            uint8_t timingWarning = 0;
            uint8_t segmentMatches[PATTERN_LENGTH - 1];  // Array to store segment match results
            if (ValidateLogin(userId, pattern, timing, &timingWarning, segmentMatches)) {
                // Login successful - reset failed attempts and mark as logged in
                if (userDatabase[userIndex].failedAttempts > 0) {
                    userDatabase[userIndex].failedAttempts = 0;
                    FlashWriteDatabase();
                }
                userDatabase[userIndex].isLoggedIn = 1;
                
                // Always show timing analysis after successful login
                ShowTimingAnalysis(segmentMatches, PATTERN_LENGTH - 1);
                delay(5000);
                
                // If timing warning exists, show additional message
                if (timingWarning) {
                    DisplayTwoLines("TIMING WARNING", "BUT LOGIN OK");
                    delay(2000);
                }
                
                // Success: login -> GREEN blink
                BlinkRGB(0, 255, 0, 3, 200, 200);
                ShowSuccess("LOGIN SUCCESS");
                delay(2000);
            } else {
                // Login failed - check if pattern matches first
                uint8_t patternMatches = ComparePatterns(userDatabase[userIndex].pattern, pattern);
                
                if (patternMatches) {
                    // Pattern matches but timing failed - show timing analysis
                    uint8_t failedSegments[PATTERN_LENGTH - 1];
                    uint8_t segmentsMatched = 0;
                    
                    for (uint8_t i = 0; i < PATTERN_LENGTH - 1; i++) {
                        uint16_t stored = userDatabase[userIndex].timing[i];
                        uint16_t input = timing[i];
                        if (stored == 0 || input == 0) {
                            failedSegments[i] = 0;
                        } else {
                            uint16_t diff = (stored > input) ? (stored - input) : (input - stored);
                            uint32_t diffPercent = (uint32_t)diff * 100 / stored;
                            if (diffPercent <= 40) {
                                failedSegments[i] = 1;
                                segmentsMatched++;
                            } else {
                                failedSegments[i] = 0;
                            }
                        }
                    }
                    
                    // Show timing analysis to explain failure
                    ShowTimingAnalysis(failedSegments, PATTERN_LENGTH - 1);
                    delay(3000);
                    
                    // Show failure reason
                    if (segmentsMatched < 2) {
                        DisplayTwoLines("TIMING FAILED", "NEED 2/4 MATCH");
                    } else {
                        DisplayTwoLines("LOGIN FAILED", "");
                    }
                    delay(2000);
                } else {
                    // Pattern doesn't match - don't show timing analysis
                    DisplayTwoLines("PATTERN", "INCORRECT");
                    delay(2000);
                }
                
                // Increment failed attempts
                userDatabase[userIndex].failedAttempts++;
                FlashWriteDatabase();

                // Check if account should be locked now
                if (userDatabase[userIndex].failedAttempts >= 3) {
                    // Failure: account just locked -> RED blink
                    BlinkRGB(255, 0, 0, 3, 200, 200);
                    ShowError("ACCOUNT LOCKED");
                    delay(3000);
                } else {
                    // Show remaining attempts
                    // Failure: wrong pattern/timing but attempts left -> RED blink
                    BlinkRGB(255, 0, 0, 3, 200, 200);
                    char msg[30];
                    uint8_t remaining = 3 - userDatabase[userIndex].failedAttempts;
                    sprintf(msg, "%u ATTEMPTS LEFT", remaining);
                    DisplayCentered(msg);
                    delay(3000);
                }
            }
            ShowMessage("REDIRECTING...", 1);
            
        } else if (finalSelection == 2) {  // DELETE selected
            // Delete user flow
            ShowMessage("DELETE MENU", 1);
            ShowMessage("LOADING...", 2);
            
            // Check if database is empty
            if (userCount == 0) {
                DisplayTwoLines("FIRST REGISTER", "USERS!");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Prompt for ID
            DisplayTwoLines("PLEASE ENTER", "ID");
            delay(2000);
            
            // Collect 2-digit ID (automatically proceeds)
            int16_t userId = CollectDigits(2, "ID");
            
            // Check if user exists
            int8_t userIndex = FindUser(userId);
            if (userIndex == -1) {
                ShowLoadingAnimation("CHECKING", 1000);
                // Failure: invalid user ID -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                ShowError("INVALID USER ID");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to menu
            }
            
            // Prompt for Pattern (authentication required)
            DisplayTwoLines("AUTHENTICATE", "TO DELETE");
            delay(2000);
            
            // Collect 5-button pattern (swipe-based)
            uint8_t pattern[PATTERN_LENGTH];
            uint16_t timing[PATTERN_LENGTH - 1];
            CollectPattern(pattern, timing);
            
            // Validate credentials
            ShowLoadingAnimation("CHECKING", 2000);
            uint8_t timingWarning = 0;
            uint8_t segmentMatches[PATTERN_LENGTH - 1];  // Array to store segment match results
            if (ValidateLogin(userId, pattern, timing, &timingWarning, segmentMatches)) {
                // Always show timing analysis after successful authentication
                ShowTimingAnalysis(segmentMatches, PATTERN_LENGTH - 1);
                delay(5000);
                
                // If timing warning exists, show additional message
                if (timingWarning) {
                    DisplayTwoLines("TIMING WARNING", "BUT AUTH OK");
                    delay(2000);
                }
                
