AdityaDk10/UbicompLab-Pic24/main.c
                // Authentication successful - show confirmation alert
                DisplayTwoLines("DELETE USER?", "CENTER=YES");
                delay(2000);
                
                // Wait for confirmation (CENTER = confirm, any other = cancel)
                uint8_t confirmBtn = WaitForButton();
                
                if (confirmBtn == 4) {  // CENTER = YES, confirm deletion
                    // Delete the user
                    if (DeleteUser(userId)) {
                        FlashWriteDatabase();
                        // Success: deletion -> GREEN blink
                        BlinkRGB(0, 255, 0, 3, 200, 200);
                        ShowSuccess("USER DELETED");
                        delay(2000);
                    } else {
                        // Failure: deletion failed -> RED blink
                        BlinkRGB(255, 0, 0, 3, 200, 200);
                        ShowError("DELETE FAILED");
                        delay(2000);
                    }
                } else {
                    // User cancelled - no action
                    DisplayTwoLines("CANCELLED", "");
                    delay(2000);
                }
            } else {
                // Authentication failed - don't allow deletion
                // Failure: wrong pattern -> RED blink
                BlinkRGB(255, 0, 0, 3, 200, 200);
                ShowError("AUTH FAILED");
                delay(3000);
            }
            ShowMessage("REDIRECTING...", 1);
            
        } else if (finalSelection == 3) {  // LIST selected
            // LIST submenu navigation - requires admin password
            ShowMessage("LIST MENU", 1);
            
            // Request admin password
            if (!VerifyAdminPassword()) {
                // Password incorrect - show error and return to main menu
                ShowLoadingAnimation("CHECKING", 1000);
                BlinkRGB(255, 0, 0, 3, 200, 200);
                ShowError("ACCESS DENIED");
                delay(3000);
                ShowMessage("REDIRECTING...", 1);
                continue;  // Back to main menu
            }
            
            // Password correct - show success and proceed
            ShowLoadingAnimation("CHECKING", 1000);
            BlinkRGB(0, 255, 0, 2, 200, 200);
            ShowSuccess("ACCESS GRANTED");
            delay(1500);
            
            // LIST submenu with two screens and navigable highlight box (always accessible, even with no users):
            // Screen 0: REGISTERED, ACTIVE USERS, LOCKED
            // Screen 1: DELETED, BACK
            // Button mapping (index from WaitForButton):
            //   0 = UP (navigate up/switch screen), 2 = DOWN (navigate down/switch screen), 
            //   4 = CENTER (select), 3 = LEFT (back to main menu)
            uint8_t listScreenIndex = 0;      // 0 = Screen 1, 1 = Screen 2
            uint8_t listSelectedIndex = 0;    // 0-2 for Screen 1, 0-1 for Screen 2
            uint8_t inListSubMenu = 1;
            
            while (inListSubMenu) {
                DrawListSubMenu(listScreenIndex, listSelectedIndex);
                uint8_t btn = WaitForButton();
                
                if (btn == 0) {          // UP
                    if (listScreenIndex == 0) {
                        // On Screen 1, navigate up within screen
                        if (listSelectedIndex > 0) {
                            listSelectedIndex--;
                        } else {
                            // At top of Screen 1, wrap to Screen 2
                            listScreenIndex = 1;
                            listSelectedIndex = 1;  // Go to BACK option
                        }
                    } else {
                        // On Screen 2, navigate up within screen
                        if (listSelectedIndex > 0) {
                            listSelectedIndex--;
                        } else {
                            // At top of Screen 2, go to Screen 1
                            listScreenIndex = 0;
                            listSelectedIndex = 2;  // Go to LOCKED option
                        }
                    }
                } else if (btn == 2) {   // DOWN
                    if (listScreenIndex == 0) {
                        // On Screen 1, navigate down within screen
                        if (listSelectedIndex < 2) {
                            listSelectedIndex++;
                        } else {
                            // At bottom of Screen 1, go to Screen 2
                            listScreenIndex = 1;
                            listSelectedIndex = 0;  // Go to DELETED option
                        }
                    } else {
                        // On Screen 2, navigate down within screen
                        if (listSelectedIndex < 1) {
                            listSelectedIndex++;
                        } else {
                            // At bottom of Screen 2, wrap to Screen 1
                            listScreenIndex = 0;
                            listSelectedIndex = 0;  // Go to REGISTERED option
                        }
                    }
                } else if (btn == 4) {   // CENTER = select
                    // Convert screen + selected index to actual option index
                    uint8_t actualIndex;
                    if (listScreenIndex == 0) {
                        actualIndex = listSelectedIndex;  // 0=REGISTERED, 1=ACTIVE USERS, 2=LOCKED
                    } else {
                        actualIndex = listSelectedIndex + 3;  // 3=DELETED, 4=BACK
                    }
                    
                    // If BACK is selected, go back to main menu
                    if (actualIndex == 4) {
                        inListSubMenu = 0;
                    } else {
                        // Display the list - after button press, return to LIST submenu
                        DisplayUserList(actualIndex);
                        // After displaying list, continue in LIST submenu loop (don't exit)
                        // The loop will continue and show the LIST submenu again
                    }
                } else if (btn == 3) {   // LEFT = back to main menu
                    inListSubMenu = 0;
                }
                // Other buttons (1=RIGHT) are ignored in menu
            }
            
            // Only show redirecting message if we're actually leaving LIST menu
            if (!inListSubMenu) {
                ShowMessage("REDIRECTING...", 1);
            }
    }
    }
    
    RGBTurnOffLED();
}
